[
  {
    "id": 1,
    "title": "Uphiri Bakithi Trans Business Cards Design",
    "slug": "uphiri-bakithi-business-cards",
    "overview": "Created a professional and visually appealing business card design to help market the client’s logistics business.",
    "problem": "Client was unhappy with their current design and needed a complete visual refresh.",
    "howWeMet": "Through a paid Facebook ad.",
    "outcomeImages": ["gd_project1_1.jpg", "gd_project1_2.jpg", "gd_project1_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Learned how to handle online clients and the risks involved — this client ultimately disappeared without paying.",
    "designProcess": "Starting with this first-ever client project, I embarked on an intensive learning journey with Photoshop. The process began with extensive research into professional business card layouts and logistics industry design trends. I experimented with different grid systems and typography hierarchies to ensure clear information presentation. Despite my limited experience, I focused on creating a balanced layout that would effectively communicate the company's services. The design went through several iterations as I learned to work with layers more effectively and discovered the importance of proper spacing and alignment. While the final result wasn't perfect, each revision taught me valuable lessons about professional design standards and the importance of maintaining open communication with clients throughout the creative process.",
    "returnClient": false
  },
  {
    "id": 2,
    "title": "ImpactWise Consultancy Promo Ad",
    "slug": "impactwise-consultancy-promo",
    "overview": "Designed a compelling promo ad to promote company registration services during a special campaign.",
    "problem": "The client needed an eye-catching, detailed design to stand out on social media.",
    "howWeMet": "Through a paid Facebook ad.",
    "outcomeImages": ["gd_project2_1.jpg", "gd_project2_2.jpg", "gd_project2_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Improved understanding of color theory and how to guide viewer attention through design.",
    "designProcess": "The design process for ImpactWise's promo ad started with a deep analysis of their target audience and competition. I created multiple mock-ups exploring different visual hierarchies to effectively communicate their services. The color palette was carefully selected to evoke trust and professionalism while maintaining visual impact. I implemented advanced layer techniques to create depth and dimension, experimenting with subtle gradients and shadow effects. The typography was chosen to enhance readability while maintaining a corporate feel. Each element was positioned strategically to guide the viewer's eye through the important information, resulting in a design that effectively balanced visual appeal with clear communication.",
    "returnClient": true
  },
  {
    "id": 3,
    "title": "DJ Nashe Services Flyer",
    "slug": "dj-nashe-flyer",
    "overview": "Crafted a vibrant flyer to promote DJ Nashe’s services as both a DJ and MC.",
    "problem": "The client had no prior design and wanted something artistic and impactful.",
    "howWeMet": "Met at a social event where he was performing.",
    "outcomeImages": ["gd_project3_1.jpg", "gd_project3_2.jpg", "gd_project3_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Mastered the art of building captivating backgrounds that elevate the overall design.",
    "designProcess": "For DJ Nashe's flyer, I began by immersing myself in contemporary music industry design trends. The creative process involved building a dynamic background that captured the energy of live performances while maintaining readability. I experimented extensively with blending modes and custom brushes to create unique lighting effects that simulated the atmosphere of a live event. The typography was carefully selected and modified to create movement and rhythm in the design. Each element was positioned to create a sense of flow and energy, while ensuring the crucial contact information remained clear and prominent. The color scheme was developed through multiple iterations to find the perfect balance between vibrant energy and professional presentation.",
    "returnClient": true
  },
  {
    "id": 4,
    "title": "Livetouch Investments Cement Brick Flyer",
    "slug": "livetouch-cement-brick-flyer",
    "overview": "Designed a high-quality flyer for Livetouch to promote their palletized standard cement bricks.",
    "problem": "Client wanted a design that enhanced credibility and attracted customer trust.",
    "howWeMet": "Organic Facebook marketing.",
    "outcomeImages": ["gd_project4_1.jpg", "gd_project4_2.jpg", "gd_project4_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Realized people were noticing my designs — it was encouraging and motivating.",
    "designProcess": "The Livetouch project required a careful balance between industrial aesthetics and visual appeal. I started by analyzing successful construction material advertisements and identifying key elements that build trust. The design process involved creating custom textures to represent cement surfaces while maintaining a clean, professional look. I developed multiple layout options focusing on product photography placement and information hierarchy. Advanced masking techniques were employed to integrate product images seamlessly with the background. The typography choices were deliberate, using strong, industrial-style fonts for headlines while keeping specifications in clear, readable fonts. The color palette was derived from the product itself, using various shades of gray with strategic color accents to create visual interest.",
    "returnClient": false
  },
  {
    "id": 5,
    "title": "Bible Society Product Catalogue",
    "slug": "bible-society-catalogue",
    "overview": "Created a clean and visually structured catalogue design ready for print.",
    "problem": "Needed organized layout with clean visuals for product display.",
    "howWeMet": "Client referral.",
    "outcomeImages": ["gd_project5_1.jpg", "gd_project5_2.jpg", "gd_project5_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "My first major print design — taught me consistency in layout and visual rhythm.",
    "designProcess": "The Bible Society catalogue project demanded a methodical approach to layout design. Beginning with a comprehensive content audit, I developed a modular grid system that would accommodate various product types consistently. The design process involved creating master templates for different page types, ensuring visual consistency throughout. I experimented with different typographic hierarchies to optimize readability and product information flow. Special attention was paid to image placement and sizing to maintain visual balance across spreads. The color scheme was carefully selected to reflect the organization's dignity while providing enough contrast for easy navigation. Each spread was individually refined while maintaining the established design system, resulting in a cohesive, professional catalogue.",
    "returnClient": true
  },
  {
    "id": 6,
    "title": "Pomeranian Puppies Flyer (Personal Project)",
    "slug": "pomeranian-puppies-flyer",
    "overview": "Designed a straightforward flyer to advertise my puppies for sale on social media.",
    "problem": "Needed a simple and clean design for quick visibility and reach.",
    "howWeMet": "Client: Myself!",
    "outcomeImages": ["gd_project6_1.jpg", "gd_project6_2.jpg", "gd_project6_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Sometimes simplicity wins — design doesn't have to be complex to be effective.",
    "designProcess": "Despite being a personal project, I approached the Pomeranian puppies flyer with professional rigor. The design process began with photo selection and enhancement, carefully adjusting lighting and colors to showcase the puppies' best features. I created several layout options, testing different approaches to highlight both individual puppies and group shots. The background design was kept intentionally minimal to maintain focus on the subjects. Typography was selected to be friendly and approachable while maintaining professionalism. The color palette was derived from the puppies' warm tones, creating a cohesive and appealing visual story. Every element was arranged to create an emotional connection while clearly presenting the essential information.",
    "returnClient": true
  },
  {
    "id": 7,
    "title": "Gift Co Valentine Promo Flyers",
    "slug": "gift-co-valentine-flyers",
    "overview": "Designed two engaging promotional flyers for Valentine’s Day to showcase Gift Co’s products across social media.",
    "problem": "Client needed unique visuals that highlighted their product range effectively in a seasonal campaign.",
    "howWeMet": "Came through a Meta paid ad.",
    "outcomeImages": ["gd_project7_1.jpg", "gd_project7_2.jpg", "gd_project7_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Gained experience working with pre-existing product images and blending them into themed compositions.",
    "designProcess": "The Valentine's Day promotion required a delicate balance between romantic appeal and commercial effectiveness. I began by developing two distinct concepts that would work together while maintaining their individual impact. The design process involved creating custom Valentine's themed elements and experimenting with different ways to showcase multiple products elegantly. Advanced layer styles were used to create depth and dimension, while careful color grading ensured product photos remained true to life. Typography choices ranged from elegant scripts for romantic elements to clean sans-serifs for pricing and details. Each flyer was designed to work both independently and as part of the campaign, with consistent branding elements tying them together.",
    "returnClient": false
  },
  {
    "id": 8,
    "title": "Mini Co Product Sale Posters",
    "slug": "mini-co-promo-posters",
    "overview": "Crafted a vibrant, double-sided poster for print and digital advertising to promote an in-store sale.",
    "problem": "Previous designs lacked energy and vibrancy — client wanted something more dynamic.",
    "howWeMet": "Discovered through a paid Facebook ad.",
    "outcomeImages": ["gd_project8_1.jpg", "gd_project8_2.jpg", "gd_project8_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Pushed my creative boundaries and worked efficiently under tight deadlines.",
    "designProcess": "The Mini Co poster project pushed the boundaries of my design capabilities. Starting with competitive research, I developed multiple concept sketches focusing on creating maximum visual impact. The design process involved extensive experimentation with 3D effects and perspective to make products pop off the page. I created custom brushes and textures to add depth and energy to the background while ensuring it didn't overshadow the products. The typography was treated as a design element itself, with custom modifications to integrate it seamlessly with the overall composition. Layer management became crucial as the design grew more complex, with each element carefully positioned and styled to create a dynamic yet cohesive final piece.",
    "returnClient": false
  },
  {
    "id": 9,
    "title": "Hybrid Experts Location Announcement Flyer",
    "slug": "hybrid-experts-flyer",
    "overview": "Designed a structured and attractive flyer to announce Hybrid Experts' presence in Bulawayo.",
    "problem": "Client wanted a clean and beautiful layout that matched their brand tone.",
    "howWeMet": "We met at their garage while I was getting my car serviced.",
    "outcomeImages": ["gd_project9_1.jpg", "gd_project9_2.jpg", "gd_project9_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Visualizing design concepts is now becoming second nature — I’m noticing a smoother creative flow.",
    "designProcess": "Hybrid Experts' location announcement demanded a perfect blend of professionalism and accessibility. The design process started with location-based research to understand the local market and competition. I developed several grid-based layouts focusing on clear communication of the new location while maintaining brand standards. The design incorporated maps and directional elements, carefully integrated with the company's existing visual identity. Typography was selected for maximum legibility at various sizes, while the color palette was refined to ensure the flyer would stand out in both digital and print formats. Each element was positioned to create a natural flow of information, guiding viewers from the announcement to the crucial location details.",
    "returnClient": true
  },
  {
    "id": 10,
    "title": "Kilimo Africa Logo Design",
    "slug": "kilimo-africa-logo",
    "overview": "Created a meaningful logo for Kilimo Africa, a business in the agricultural space.",
    "problem": "Client wanted a logo that reflected their mission and values but also felt modern.",
    "howWeMet": "Client was referred by a previous satisfied customer.",
    "outcomeImages": ["gd_project10_1.jpg", "gd_project10_2.jpg", "gd_project10_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Realized Photoshop isn’t ideal for logo work — pushed me to begin learning Adobe Illustrator.",
    "designProcess": "The Kilimo Africa logo design process began with extensive research into agricultural symbolism and African design motifs. Despite working in Photoshop, I focused on creating clean, scalable shapes that could later be vectorized. The design journey involved multiple sketches exploring different combinations of agricultural and African elements. Color selection was particularly crucial, choosing earth tones that reflected both the agricultural focus and African heritage. Each iteration was tested at various sizes to ensure visibility and recognition. Though challenging without vector tools, this project pushed me to maximize Photoshop's capabilities while identifying areas for future tool expansion.",
    "returnClient": true
  },
  {
    "id": 11,
    "title": "Ms Chichie Tutoring Services Flyer",
    "slug": "ms-chichie-tutoring-flyer",
    "overview": "Developed a soft, appealing flyer to advertise Cambridge tutoring services run by my wife.",
    "problem": "Client wanted a simple, effective design that connected with students and parents.",
    "howWeMet": "Pillowtalks — she’s my wife!",
    "outcomeImages": ["gd_project11_1.jpg", "gd_project11_2.jpg", "gd_project11_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Strengthened my photo editing and image color balancing techniques.",
    "designProcess": "Designing for Ms Chichie's tutoring service required a perfect balance between professionalism and approachability. The process began with research into educational marketing and competitor analysis. I developed multiple concepts focusing on creating a welcoming yet authoritative presence. The design involved careful photo selection and enhancement to create the right atmosphere. Typography choices were critical, using a combination of fonts that projected both academic credibility and accessibility. The color palette was developed to be engaging without being overwhelming, using softer tones that appeal to both parents and students. Each element was positioned to create a clear hierarchy of information while maintaining visual interest.",
    "returnClient": true
  },
  {
    "id": 12,
    "title": "Gift Co Mother’s Day Promo Ad",
    "slug": "gift-co-mothers-day",
    "overview": "Crafted a themed promotional flyer to showcase Gift Co’s products for a Mother’s Day campaign.",
    "problem": "Client needed a visually captivating design to highlight gift options for Mother’s Day.",
    "howWeMet": "This was a return client from a previous Valentine’s campaign.",
    "outcomeImages": ["gd_project13_1.jpg", "gd_project13_2.jpg", "gd_project13_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop"],
    "lessonsLearnt": "Realized how far I’d come — my designs were becoming more cohesive and emotionally appealing.",
    "designProcess": "The Mother's Day campaign for Gift Co required a sensitive and sophisticated approach. The design process began with mood boarding to capture the right emotional tone. I explored various ways to showcase products while maintaining the sentimental nature of the occasion. Advanced layer techniques were used to create soft, elegant backgrounds that complemented the product photography. Typography was carefully selected to convey both emotion and information, with a mix of decorative and practical fonts. The color palette was built around gentle, feminine tones while ensuring product colors remained accurate. Each element was positioned to tell a story, creating an emotional connection while effectively showcasing the gift options.",
    "returnClient": true
  },
  {
    "id": 13,
    "title": "ArthurFord Generic Product Flyer",
    "slug": "arthurford-product-flyer",
    "overview": "Designed a multi-product flyer for ArthurFord to promote their entire range across social media.",
    "problem": "Client wanted a clean, unique flyer that showcased multiple product types in a scroll-stopping design.",
    "howWeMet": "Referred by a happy previous client.",
    "outcomeImages": ["gd_project14_1.jpg", "gd_project14_2.jpg", "gd_project14_3.jpg"],
    "technologiesUsed": ["Adobe Photoshop", "Grok AI"],
    "lessonsLearnt": "Enhanced my product image manipulation skills and discovered the potential of AI-assisted visuals.",
    "designProcess": "ArthurFord's multi-product flyer presented an exciting technical challenge. The design process began with extensive product photo curation and enhancement using AI tools to maintain consistency across various product types. I developed a modular layout system that could accommodate different product categories while maintaining visual harmony. Layer management became crucial as I built complex compositions using both AI-generated elements and traditional Photoshop techniques. The background design was crafted to unify diverse products while ensuring each stood out. Typography was carefully selected to work across different sections while maintaining readability. The final design balanced technical innovation with proven design principles, creating a modern and effective promotional tool.",
    "returnClient": true
  },
  {
    "id": 14,
    "title": "Fronomenal by Raine Branding Redesign",
    "slug": "fronomenal-branding-redesign",
    "overview": "Complete rebranding for Fronomenal including packaging designs and a refreshed logo.",
    "problem": "Client’s previous designs were low-quality JPEGs, unfit for print, with no access to source files.",
    "howWeMet": "Discovered through organic Facebook marketing.",
    "outcomeImages": ["gd_project15_1.jpg", "gd_project15_2.jpg", "gd_project15_3.jpg", "gd_project15_4.jpg", "gd_project15_5.jpg"],
    "technologiesUsed": ["Adobe Photoshop", "Adobe Illustrator"],
    "lessonsLearnt": "Learned how to maintain visual consistency across multiple branded products using professional design tools.",
    "designProcess": "The rebranding journey began with an in-depth discovery phase, analyzing the client's existing brand elements and market positioning. The first step involved converting all existing designs into high-quality vector formats, ensuring scalability and print readiness. We then explored various typography combinations and color palettes that would resonate with their target market while maintaining brand recognition. The logo redesign went through multiple iterations, each time refining the balance between modern aesthetics and the brand's established identity. For the packaging designs, we created a cohesive system that would work across different product sizes while maintaining visual hierarchy and brand consistency. Each element was carefully crafted with both digital and print applications in mind, ensuring the designs would look impressive whether on social media or on physical products. The final phase involved creating a comprehensive style guide to ensure consistent brand implementation across all future materials.",
    "returnClient": true
  }
]
